# อันนี้คือวิธีการเดินหมากว่าตัวไหนควรไปช่องไหน
from checkmate import checkmate #นำเข้า ฟังก์ชัน ชื่อว่า checkmate จาก ไฟล์หรือโมดูล ที่ชื่อว่า checkmate.py หมายความว่าในไฟล์ checkmate.py ต้องมีฟังก์ชันชื่อ checkmate(board) อยู่

def main(): #นิยามฟังก์ชัน main() ซึ่งเป็นจุดเริ่มต้นของโปรแกรม
     # สร้าง กระดานหมากรุก (board) โดยใช้ string แบบหลายบรรทัด (multi-line string)ตัวอักษรในกระดานมีความหมายประมาณนี้: .... = ช่องว่าง K = ราชา (King) R = เรือ (Rook)
    board = """\         
....       
.K..
.R..
...."""
    checkmate(board)   # เรียกฟังก์ชัน checkmate โดยส่งตัวแปร board เข้าไป หน้าที่ของฟังก์ชันนี้ (ตามชื่อ) คือการ ตรวจสอบว่าราชา (K) โดนรุกฆาต (checkmate) หรือไม่ จากตำแหน่งของหมากอื่น ๆ

if __name__ == "__main__": #เช็กว่าไฟล์นี้ถูกเรียกให้ทำงานโดยตรง ไม่ได้ถูก import จากไฟล์อื่น
    main() #ถ้าไฟล์นี้ถูกรันโดยตรง ก็จะเรียกฟังก์ชัน main()
    # 1.โปรแกรมนี้เตรียมกระดานหมากรุกแบบ 4x4 2.ส่งกระดานไปให้ฟังก์ชัน checkmate(board) ตรวจสอบ 3.ตัวอย่างนี้ดูเหมือนจะเช็กว่า King จะโดน Rook จับกินหรือไม่
